{
  "add_cross_attention": false,
  "architectures": [
    "XLMRobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-auteur",
    "2": "I-auteur",
    "3": "B-ouvrage",
    "4": "I-ouvrage",
    "5": "B-material",
    "6": "I-material",
    "7": "B-date",
    "8": "I-date",
    "9": "B-etat",
    "10": "I-etat"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-auteur": 1,
    "B-date": 7,
    "B-etat": 9,
    "B-material": 5,
    "B-ouvrage": 3,
    "I-auteur": 2,
    "I-date": 8,
    "I-etat": 10,
    "I-material": 6,
    "I-ouvrage": 4,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "tie_word_embeddings": true,
  "transformers_version": "5.8.1",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 250002
}
